cylinderScouring/case2_twist/system/blockMeshDict
 /*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 6 -3  0) // 0
    ( 6  3  0) // 1
    (-3  3  0) // 2
    (-3 -3  0) // 3
    ( 6 -3  1.5) // 4
    ( 6  3  1.5) // 5
    (-3  3  1.5) // 6
    (-3 -3  1.5) // 7 
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (60 90 15)
    simpleGrading (1 1 1)
);

patches
(
    patch inlet
    (
        (2 6 7 3) // (0 4 5 1)
    )
    patch outlet
    (
        (0 4 5 1) // (2 6 7 3)
    )
    wall upperwall
    (
	(4 7 6 5) // 뚜껑
    )
    wall walls
    (
	(0 1 2 3) // 바닥
    )
    symmetry rightwall
    (
        (1 5 6 2) //오른쪽
    )
    symmetry leftwall
    (
        (0 4 7 3) // 왼쪽
    )
);

edges
(
);

mergePatchPairs
(
);

// ************************************************************************* //
